In [1]:
import numpy as np
import pandas as pd

In [6]:
s = pd.Series([1, 2, np.nan, 4, np.nan, 5, np.nan], index = ['a', 'b', 'c', 'd', 'e','f', 'g'])

In [7]:
s

a    1.0
b    2.0
c    NaN
d    4.0
e    NaN
f    5.0
g    NaN
dtype: float64

In [8]:
s.count()

4

In [9]:
s.values

array([ 1.,  2., nan,  4., nan,  5., nan])

In [14]:
s.value_counts()

1.0    1
2.0    1
4.0    1
5.0    1
dtype: int64

In [15]:
s.value_counts(normalize = True)

1.0    0.25
2.0    0.25
4.0    0.25
5.0    0.25
dtype: float64

In [20]:
type(np.random.randn(10))

numpy.ndarray

In [39]:
df = pd.DataFrame([np.arange(1, 6, 1), np.arange(6, 11, 1), np.arange(1, 5)])

In [40]:
df

   0  1  2  3     4
0  1  2  3  4   5.0
1  6  7  8  9  10.0
2  1  2  3  4   NaN

In [42]:
df[0]

0    1
1    6
2    1
Name: 0, dtype: int64

In [43]:
df[[0, 3]]

   0  3
0  1  4
1  6  9
2  1  4

In [44]:
df[:1]

   0  1  2  3    4
0  1  2  3  4  5.0

In [49]:
df.iloc[[1, 2], 0]

1    6
2    1
Name: 0, dtype: int64

In [52]:
df.loc[0]

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: 0, dtype: float64